DataProcessors/ЗаменаУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ЗаменаУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлЕксель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУправленияУслугами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаСтарая</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга6</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга7</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга8</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга9</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга10</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга11</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга12</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУправленияУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияУслугами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеНазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКачестваУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УправлениеУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеУслугами</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеУслугиПодробно</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.КачествоУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУправленияУслугами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКачества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоУслуге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ЗаменаУслуг/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Путь = Объект.ФайлЕксель;
	Если НЕ ЗначениеЗаполнено(Объект.ФайлЕксель) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если Объект.ЛицевыеСчета.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	Объект.ЛицевыеСчета.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ЛицевыеСчета.Добавить();
		НоваяСтрока.Адрес            = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.УслугаСтарая     = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ЛицевойСчет      = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Услуга1          = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Услуга2          = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.Услуга3          = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.Услуга4          = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.Услуга5          = Excel.Cells(Счетчик, 8).Value;
		НоваяСтрока.Услуга6          = Excel.Cells(Счетчик, 9).Value;
		НоваяСтрока.Услуга7          = Excel.Cells(Счетчик, 10).Value;
		НоваяСтрока.Услуга8          = Excel.Cells(Счетчик, 11).Value;
		НоваяСтрока.Услуга9          = Excel.Cells(Счетчик, 12).Value;
		НоваяСтрока.Услуга10         = Excel.Cells(Счетчик, 13).Value;
		НоваяСтрока.Услуга11         = Excel.Cells(Счетчик, 14).Value;
		НоваяСтрока.Услуга12         = Excel.Cells(Счетчик, 15).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура УстановитьУслугиНаСервере()
	Для Каждого стр Из Объект.ЛицевыеСчета Цикл
		ЛС = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		// Отключение услуги
		НазначенныеУслуги = НайтиУслугиПоЛС(ЛС, Объект.НаДату);
		ДокОтменаУслуг = Документы.УправлениеУслугами.СоздатьДокумент();
		ДокОтменаУслуг.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги;
		ДокОтменаУслуг.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокОтменаУслуг.Дата = Объект.НаДату;
		ДокОтменаУслуг.ДатаОкончания = Объект.НаДату;
		ДокОтменаУслуг.Здание = ЛС.Владелец;
		ДокОтменаУслуг.Организация = Объект.Организация;
		НовЛС = ДокОтменаУслуг.ЛицевыеСчета.Добавить();
		НовЛС.ЛицевойСчет = ЛС;
		Для Каждого стрУслуги Из НазначенныеУслуги Цикл
			НовСтрока = ДокОтменаУслуг.Услуги.Добавить();
			НовСтрока.Услуга = стрУслуги.Услуга;
		КонецЦикла;
		Попытка
			ДокОтменаУслуг.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ДокОтменаУслуг.Записать();
			Сообщить("Не вдалося зупинити послуги по особовому рахунку № " + ЛС);
		КонецПопытки;
		
		// Назначить новые услуги
		ДокНазначениеУслуг = Документы.УправлениеУслугами.СоздатьДокумент();
		ДокНазначениеУслуг.Автор = ПараметрыСеанса.ТекущийПользователь;
		ДокНазначениеУслуг.Дата = Объект.НаДату;
		ДокНазначениеУслуг.ДатаНачала = НачалоДня(Объект.НаДату);
		ДокНазначениеУслуг.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги;
		ДокНазначениеУслуг.Здание = ЛС.Владелец;
		НовЛС = ДокНазначениеУслуг.ЛицевыеСчета.Добавить();
		НовЛС.ЛицевойСчет = ЛС;
		ДокНазначениеУслуг.Организация = Объект.Организация;
		Если ЗначениеЗаполнено(стр.Услуга1) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга1);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга2) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга2);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга3) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга3);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга4) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга4);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга5) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга5);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга6) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга6);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга7) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга7);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга8) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга8);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга9) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга9);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга10) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга10);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга11) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга11);
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Услуга12) Тогда
			НовСтрока = ДокНазначениеУслуг.Услуги.Добавить();
			НовСтрока.Услуга = Справочники.Услуги.НайтиПоНаименованию(стр.Услуга12);
		КонецЕсли;
		Попытка
			ДокНазначениеУслуг.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ДокНазначениеУслуг.Записать();
			Сообщить("Не вдалося призначити послуги по особовому рахунку № " + ЛС);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУслуги(Команда)
	УстановитьУслугиНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиЛицевойСчет(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет.Наименование = &ЛицевойСчет И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаСервере
Функция НайтиУслугиПоЛС(ЛС, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	НазначенныеУслугиСрезПоследних.Услуга
	    |ИЗ
	    |	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	    |			&НаДату,
	    |			ЛицевойСчет = &ЛицевойСчет
	    |				И Действует = ИСТИНА) КАК НазначенныеУслугиСрезПоследних";
    Запрос.УстановитьПараметр("НаДату", Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции
